#配置准输出终端上的记录
echo "set-option -g history-limit  655355555" >>~/.tmux.conf
#创建session

tmux

#在其他终端连接到之前创建的session,方便多人多终端共享屏幕，
tmux list-sessions
1: 1 windows (created Mon Jul 31 12:46:52 2017) [204x59]
tmux attach -t 1

#查看当前系统时间
ctrl+b t


Ctrl+b	激活控制台；此时以下按键生效
系统操作	?	列出所有快捷键；按q返回
d	脱离当前会话；这样可以暂时返回Shell界面，输入tmux attach能够重新进入之前的会话，这个最好用，即使ssh连接断掉，session依然保存在server上，第二天过来attach后还可以继续操作，之前的记录还都在

D	选择要脱离的会话；在同时开启了多个会话时使用
Ctrl+z	挂起当前会话
r	强制重绘未脱离的会话
s	选择并切换会话；在同时开启了多个会话时使用
:	进入命令行模式；此时可以输入支持的命令，例如kill-server可以关闭服务器
[	进入复制模式；此时的操作与vi/emacs相同，按q/Esc退出
~	列出提示信息缓存；其中包含了之前tmux返回的各种提示信息
窗口操作
c	创建新窗口
&	关闭当前窗口
数字键	切换至指定窗口
p	切换至上一窗口
n	切换至下一窗口
l	在前后两个窗口间互相切换
w	通过窗口列表切换窗口
,	重命名当前窗口；这样便于识别
.	修改当前窗口编号；相当于窗口重新排序
f	在所有窗口中查找指定文本
面板操作
”	将当前面板平分为上下两块
%	将当前面板平分为左右两块
x	关闭当前面板
!	将当前面板置于新窗口；即新建一个窗口，其中仅包含当前面板
PgUp/ 上翻查看准输出终端上的信息
PgDn 下翻查看准输出终端上的信息
Space	在预置的面板布局中循环切换；依次包括even-horizontal、even-vertical、main-horizontal、main-vertical、tiled
q	显示面板编号
o	在当前窗口中选择下一面板

方向键左 方向左/右在分割的屏幕进行切换

方键下 方向左/右在分割的屏幕进行切换
